import { v5 as uuidv5 } from 'uuid';
import { GameWindow } from '~/types';

const GAME_WINDOWS_NAMESPACE = 'ff7a34c7-01b7-4dbb-a496-65055db9d042';

const getUUID = (id: string) => uuidv5(id, GAME_WINDOWS_NAMESPACE);
const getImgPath = (img: string) => '/assets/images/' + img;

const gameWindowsPlot: GameWindow[] = [
  {
    id: getUUID('1'),
    title: [
      'Тумани застеляє землю, черевики вгрузають у багнюку, кров і залишки людських тіл.',
      'А може і не тільки людських?',
      'Що ж тут трапилось?',
      'Чи залишився хтось в живих?',
      'Здається щось ворушиться у тих хащах.',
      '{userName}, що будете робити?'
    ],
    image: getImgPath('screen-1.jpg'),
    contentStyle: 'max-w-3xl',
    answers: [
      {
        text: 'Залишитись на місці, чорт з ним.',
        gameOver: {
          image: getImgPath('game-over-screen-1.jpg'),
          textStyle: 'relative top-48',
          text: '{userName}, вибачте, але в такі буремні часи не можно бути боягузом. Ви ще не готові йти далі.'
        }
      },
      {
        text: 'Подивитися',
        gameWindowNextId: getUUID('2')
      }
    ]
  },
  {
    id: getUUID('2'),
    title: [
      'Ризикнувши ви знайшли поранену тварину.',
      'Бідному оленю залишилось не довго.',
      'Принаймні без допомоги.',
      'Але хто тоді допоможе Вaм?',
      "Пам'ятайте після важкого шляху і перебуванні на болотах у вас залишилось мало здоровʼя."
    ],
    image: getImgPath('screen-2.jpeg'),
    contentStyle: 'ml-auto max-w-3xl top-24 text-right',
    actionStyle: 'ml-auto max-w-2xl',
    answers: [
      {
        text: 'Полегшити страждання тварини та подарувати легку смерть.',
        setHp: -20,
        gameWindowNextId: getUUID('3')
      },
      {
        text: 'Покластися на волю Богів і пройти повз. Якщо доля, то тварина виживе.',
        gameWindowNextId: getUUID('3')
      },
      {
        text: 'Проявити милосердя. Використати свій флакон із чарівним зіллям і вилікувати тварину.',
        setMana: 10,
        setHpPotion: -1,
        gameWindowNextId: getUUID('3')
      }
    ]
  },
  {
    id: getUUID('3'),
    image: getImgPath('screen-3.jpg'),
    contentStyle: 'max-w-6xl',
    actionStyle: 'max-w-4xl',
    dialogs: [
      [
        'Добре. Розібравшись з останньою живою душею тут можна рухатися далі.',
        'Скрипучі двері таверни викликають дивну реакцію у  любителів міцних напоїв і пересмажених свиних вух.'
      ],
      [
        'Лойс, агов! Налий мені кухоль пива, адже я виконав твоє завдання швидше ніж обіцяв.',
        'Додаткову плату за це не візьму не враховуючи пива і гарячого шматка мʼяса.'
      ],
      ['Що, значить в тебе для мене нічого не має?'],
      ['До Вас підходить озброєна і не дружньо налаштована компанія.'],
      [
        'Якщо Лойс каже, що у нього для тебе нічого немає,',
        'значить так і є.',
        'Звільни місце, не затримуй бармена.',
        'Тут усі зайняті своїми справами.'
      ],
      [
        'Наразі справа Лойса - віддати мені борг.',
        'І чим швидше він це зробить',
        'тим швидше ви хлопці зможете напитися до забуття.',
        'Вийдіть покуріть, ми швидко.',
        'Правда, Лойс?'
      ],
      ['Агов, блондинчику.', 'Ти наче загубився і ми зараз допоможемо тобі знайти вихід.']
    ],
    answers: [
      {
        text: ['Які ж турботливі,', 'давайте мій кулак допоможе вашим зубам знайти вихід.'],
        setHp: -80,
        setMoney: 25,
        gameWindowNextId: getUUID('4')
      },
      {
        text: 'Дозвольте магії вільно рухатись крізь пальці.',
        setMana: -10,
        setMoney: 25,
        gameWindowNextId: getUUID('5')
      }
    ]
  },
  {
    id: getUUID('4'),
    image: getImgPath('screen-4.jpg'),
    gameWindowNextId: getUUID('6'),
    title: [
      'Битва була нелегка.',
      'Ви пропустили пару міцних ударів по обличчю, але змогли дати гідну відсіч.',
      'Поклавши на лопатки 3 бандитів ви вийшли переможцем.',
      'Заплативши ціну в пару синців і зломане ребро.'
    ]
  },
  {
    id: getUUID('5'),
    image: getImgPath('screen-5.jpeg'),
    gameWindowNextId: getUUID('6'),
    dialogs: [
      ['Ще один глибокий вдих і зачаровую решту ворожо налаштованої компанії.'],
      ['Мені потрібні тільки мої гроші і спокійно піду.'],
      ['Хлопці зачаровано кивають і відходять до свого столика.']
    ]
  },
  {
    id: getUUID('6'),
    image: getImgPath('screen-6.jpeg'),
    textStyle: 'max-w-4xl',
    dialogs: [
      ['Зачинивши двері таверни ви вирішили закурити і подумати, що робити далі.'],
      ['Чорт, десь загубив сірники.'],
      ['До Вас підходить дівчинка і простягає сірники.'],
      [
        '{userName}, Маю для вас замовлення.',
        'Точніше мій батько.',
        'А ще мама приготувала обід.',
        'Не пересмажене мʼясо як в таверні і ніхто не буде намагатися вас вбити.',
        'Принаймні, я точно.'
      ]
    ],
    gameWindowNextId: getUUID('7')
  },
  {
    id: getUUID('7'),

    textStyle: 'max-w-5xl text-right ml-auto',
    actionStyle: 'text-right max-w-4xl ml-auto',
    dialogs: [
      ['Не встиг суп охолонути, як на мене вивалили чергове складне завдання.'],
      ['Вся надія тільки на тебе, {userName}! Тільки ти можеш врятувати мою доню.'],
      [
        'Вона ж мене одна єдина,',
        'а я дурень такий не вберіг.',
        'Здався нам той первоцвіт!',
        'Поперлися ми в ліс о півночі квітку шукати.',
        'Думали озолотитися і відремонтувати хату.'
      ],
      ['Так ось тепер цим золотом, хоч удавись.', 'А доньку покусав перевертень'],
      ['Допоможи, поки не пізно.', 'Врятуй дівчину від перетворення.']
    ],
    image: getImgPath('screen-7.jpeg'),
    answers: [
      {
        text: 'А що мені вже втрачати? Згоден. Але ви повинні заплатити мені аванс.',
        setMoney: 100,
        gameWindowNextId: getUUID('9')
      },
      {
        text: 'Слухай, мала, мені добряче дісталося. Треба залягти на дно і залікувати рани. Давай наступного разу, домовились?',
        gameWindowNextId: getUUID('10')
      },
      {
        text: 'Дівчинка хамовита, суп пересолений, мʼясо маленький шматок поклали. Не варті вони моїх старань, а от грошики я собі візьму. Пограбую цих селюків і поїду собі далі.',
        setMoney: 100,
        setHp: -30,
        gameWindowNextId: getUUID('10')
      }
    ]
  },
  {
    id: getUUID('9'),
    title: [
      'Врятувати її може тільки магічний еліксир.',
      'У мене його не має.',
      'Треба відправлятися в ліс на пошуки чаклунки'
    ],
    image: getImgPath('screen-9.png'),
    gameWindowNextId: getUUID('12')
  },
  {
    id: getUUID('10'),
    image: getImgPath('screen-8.jpg'),
    dialogs: [
      [
        'Треба рухатись далі і якнайшвидше залишити це зловісне поселення.',
        'Знову спати у лісі на холодній землі.',
        'Проте це краще ніж отримати по пиці від половини міста.'
      ],
      [
        'От лайно!',
        'Тільки я провалився у теплі руки царства Морфея, як на мене, напав перевертень.',
        'Що ж це за прокляте місце!'
      ],
      ['Тепер мені треба знайти зілля, щоб не стати перевертнем, часу обмаль.']
    ],
    answers: [
      {
        text: 'Відправитись на пошуки зілля',
        setHp: -20,
        gameWindowNextId: getUUID('12')
      }
    ]
  },
  {
    id: getUUID('12'),
    image: getImgPath('screen-11.jpg'),
    actionStyle: 'max-w-xl',
    dialogs: [
      ['Треба шукати річку в лісі.', 'Чаклунка бере свої сили з природних стихій.', 'Там я її і впіймаю.'],
      [
        'Юна відьма, саме те що мені потрібно.',
        'Мені потрібно зілля, яке врятує від обернення на перевертеня.',
        'Скажи, що в тебе воно є.'
      ],
      ['Ага, нарешті мені почало щастити.'],
      ['Стій, що значить залишилась остання порція?'],
      ['І просто так ти її не віддаси?']
    ],
    answers: [
      {
        text: 'Я можу застосувати свою магію і примусити чаклунку віддати мені зілля просто так.',
        setMana: -10,
        gameOver: {
          image: getImgPath('game-over-screen-5.webp'),
          textStyle: 'mr-auto !text-left max-w-[490px]',
          text: [
            '{userName}, вітаю',
            'Завдяки вашому досвіду і навичкам ви - врятували дівчину і успішно подолали всі випробування.',
            'Настав час отримати свою винагороду!',
            'Проте батько-невдаха на радощах пропив усі гроші і йому немає, що вам запропонувати.',
            '',
            'Ти віддаси мені те, що вже маєш, про що ще не знаєш ...'
          ]
        }
      },
      {
        text: 'Добре, що в мене є гроші і можу чесно обміняти гроші на порцію еліксиру',
        setMoney: -120,
        gameWindowNextId: getUUID('13')
      },
      {
        text: 'Я впораюсь і без порції твого дурнуватого зілля',
        gameOver: {
          image: getImgPath('game-over-screen-2.jpg'),
          textStyle: '!max-w-7xl',
          text: [
            'Ви ще якийсь час блукали і намагалися роздобути чарівний флакон.',
            'Але час був не на вашому боці.',
            'Ви не встигли врятувати ні дівчину, ні себе.',
            'Залишається тільки чекати на свою участь.',
            'Що ж, це місто саме накликало на себе біду.',
            'Тепер ріки крові заллють його вулиці і будинки.'
          ]
        }
      }
    ]
  },
  {
    id: getUUID('13'),
    image: getImgPath('screen-12.jpeg'),
    textStyle: 'ml-auto text-right',
    actionStyle: 'ml-auto text-right',
    title: [
      'От тільки тепер треба обрати кого рятувати.',
      'Відьмак, хто має перетворитися на монстра?',
      'Кого ти врятуєш?'
    ],
    answers: [
      {
        text: 'Повернутися із зіллям до міста. Врятувати дівчинку.',
        gameWindowNextId: getUUID('14')
      },
      {
        text: 'Я обираю застосувати зілля на собі.',
        gameOver: {
          textStyle: 'ml-14 mr-auto max-w-md text-left',
          text: [
            'Всіх грошей не заробиш, а своя шкіра ближча.',
            'Дівчинка стає перевертнем і розриває на частини місцевих жителів.',
            'Кінець.',
            'Ти - програв. Кожне життя важливе!'
          ],
          image: getImgPath('game-over-screen-4.jpg')
        }
      }
    ]
  },
  {
    id: getUUID('14'),
    image: getImgPath('screen-13.jpeg'),
    textStyle: 'ml-auto text-right',
    actionStyle: 'ml-auto text-right',
    dialogs: [
      ['Ура, мер місто тобі безмежно вдячний.', 'Він і усе місто дарує тобі мішок золота.'],
      ['Шкода, що ти не встигнеш ним скористуватися.', 'В тебе залишилось обмаль часу.']
    ],
    answers: [
      {
        text: 'Залишити місто',
        gameOver: {
          image: getImgPath('game-over-screen-3.jpeg'),
          textStyle: '!max-w-xl',
          text: [
            'О, ні!',
            'Ви не встигли втекти на безпечну відстань від міста.',
            'Виходить повний місяць.',
            'Ви перетворюєтеся на перевертня і повертаєтеся до міста за свіжою кровʼю.'
          ]
        }
      }
    ]
  }
];

export default gameWindowsPlot;
